app/models/ticket.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def ticket_date
  	t= TicketType.find(self.ticket_type_id)
  	e= Event.find(t.id)